<a href="https://colab.research.google.com/github/keinam53/Machine_learning/blob/main/Uczenie_nadzorowane/1_Wst%C4%99p/3_Ekstrakcja_cech.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Ekstrakcja cech
1. [Import bibliotek](#0)
2. [Załadowanie danych](#1)
3. [Utworzenie kopii danych](#2)
4. [Generowanie nowych zmiennych](#3)
5. [Dyskretyzacja zmiennej ciągłej](#4)
6. [Ekstrakcja cech](#5)

### <a name='0'></a> Import bibliotek

In [1]:
import numpy as np
import pandas as pd
import sklearn

sklearn.__version__

'0.22.2.post1'

### <a name='1'></a> Załadowanie danych
Funkcja pobierająca wartość spółki Amazon

In [4]:
def fetch_financial_data(company='AMZN'):
  import pandas_datareader.data as web
  return web.DataReader(name=company, data_source='stooq')

df_raw = fetch_financial_data()
df_raw.head()

               Open       High        Low    Close   Volume
Date
2021-07-02  3451.64  3511.7200  3436.9200  3510.98  3176697
2021-07-01  3434.61  3457.0000  3409.4206  3432.97  2037053
2021-06-30  3441.06  3471.6019  3435.0000  3440.16  2403992
2021-06-29  3438.82  3456.0300  3423.0300  3448.14  2098439
2021-06-28  3416.00  3448.0000  3413.5098  3443.89  2242793

### <a name='2'></a> Utworzenie kopii danych

In [5]:
df = df_raw.copy()
df = df[:5]
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 5 entries, 2021-07-02 to 2021-06-28
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Open    5 non-null      float64
 1   High    5 non-null      float64
 2   Low     5 non-null      float64
 3   Close   5 non-null      float64
 4   Volume  5 non-null      int64
dtypes: float64(4), int64(1)
memory usage: 240.0 bytes

### <a name='3'></a> Generowanie nowych zmiennych

In [7]:
df.index.day

Int64Index([2, 1, 30, 29, 28], dtype='int64', name='Date')

In [8]:
df['day'] = df.index.day
df['month'] = df.index.month
df['year'] = df.index.year
df

               Open       High        Low    Close   Volume  day  month  year
Date
2021-07-02  3451.64  3511.7200  3436.9200  3510.98  3176697    2      7  2021
2021-07-01  3434.61  3457.0000  3409.4206  3432.97  2037053    1      7  2021
2021-06-30  3441.06  3471.6019  3435.0000  3440.16  2403992   30      6  2021
2021-06-29  3438.82  3456.0300  3423.0300  3448.14  2098439   29      6  2021
2021-06-28  3416.00  3448.0000  3413.5098  3443.89  2242793   28      6  2021

### <a name='4'></a> Dyskretyzacja zmiennej ciągłej
cut() - tworzenie przedziałów wartości

In [9]:
df = pd.DataFrame(data={'height': [175., 178.5, 185., 191., 184.5, 183., 168.]})
df

   height
0   175.0
1   178.5
2   185.0
3   191.0
4   184.5
5   183.0
6   168.0

In [12]:
df['height-cut'] = pd.cut(x=df['height'], bins=3)
df

   height          height-cut
0   175.0  (167.977, 175.667]
1   178.5  (175.667, 183.333]
2   185.0    (183.333, 191.0]
3   191.0    (183.333, 191.0]
4   184.5    (183.333, 191.0]
5   183.0  (175.667, 183.333]
6   168.0  (167.977, 175.667]

In [16]:
df['height-cut'] = pd.cut(x=df['height'], bins=(160, 175, 180, 195))
df

   height  height-cut
0   175.0  (160, 175]
1   178.5  (175, 180]
2   185.0  (180, 195]
3   191.0  (180, 195]
4   184.5  (180, 195]
5   183.0  (180, 195]
6   168.0  (160, 175]

In [18]:
df['height-cut'] = pd.cut(x=df['height'], bins=(160, 175, 180, 195), labels=['small', 'medium', 'high'])
df

   height height-cut
0   175.0      small
1   178.5     medium
2   185.0       high
3   191.0       high
4   184.5       high
5   183.0       high
6   168.0      small

In [19]:
pd.get_dummies(data=df, drop_first=True, prefix='heigh')

   height  heigh_medium  heigh_high
0   175.0             0           0
1   178.5             1           0
2   185.0             0           1
3   191.0             0           1
4   184.5             0           1
5   183.0             0           1
6   168.0             0           0

### <a name='5'></a> Ekstrakcja cech

In [20]:
df = pd.DataFrame(data={'lang': [['PL', 'ENG'], ['GER', 'ENG', 'PL', 'FRA'], ['RUS']]})
df

                  lang
0            [PL, ENG]
1  [GER, ENG, PL, FRA]
2                [RUS]

In [21]:
df['lang_number'] = df['lang'].apply(len)
df

                  lang  lang_number
0            [PL, ENG]            2
1  [GER, ENG, PL, FRA]            4
2                [RUS]            1

In [22]:
df['PL_flag'] = df['lang'].apply(lambda x: 1 if 'PL' in x else 0)
df

                  lang  lang_number  PL_flag
0            [PL, ENG]            2        1
1  [GER, ENG, PL, FRA]            4        1
2                [RUS]            1        0

In [23]:
df = pd.DataFrame(data={'website': ['wp.pl', 'onet.pl', 'google.com']})
df

      website
0       wp.pl
1     onet.pl
2  google.com

In [25]:
df['website'].str.split('.', expand=True)

        0    1
0      wp   pl
1    onet   pl
2  google  com

In [26]:
new = df['website'].str.split('.', expand=True)
df['portal'] = new[0]
df['extension'] = new[1]
df

      website  portal extension
0       wp.pl      wp        pl
1     onet.pl    onet        pl
2  google.com  google       com